In [2]:
import pandas as pd 
from sqlalchemy import create_engine
# from postgres_password import pass_word

In [3]:
location_csv=pd.read_csv("data/country-capitals.csv")
location_csv.head()

,CountryName,CapitalName,CapitalLatitude,CapitalLongitude,CountryCode,ContinentName
0,Aland Islands,Mariehamn,60.116667,19.900000,AX,Europe
1,Albania,Tirana,41.316667,19.816667,AL,Europe
2,Andorra,Andorra la Vella,42.500000,1.516667,AD,Europe
3,Armenia,Yerevan,40.166667,44.500000,AM,Europe
4,Austria,Vienna,48.200000,16.366667,AT,Europe

In [4]:
arrivals_csv=pd.read_csv("data/arrivals.csv")
arrivals_csv.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Aruba,ABW,"International tourism, number of arrivals",ST.INT.ARVL,NaN,NaN,NaN,NaN,NaN,NaN,...,1469000.0,1481000.0,1667000.0,1739000.0,1832000.0,1758000.0,1863000.0,1897000.0,1951000.0,NaN
1,Afghanistan,AFG,"International tourism, number of arrivals",ST.INT.ARVL,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Angola,AGO,"International tourism, number of arrivals",ST.INT.ARVL,NaN,NaN,NaN,NaN,NaN,NaN,...,481000.0,528000.0,650000.0,595000.0,592000.0,397000.0,261000.0,218000.0,218000.0,NaN
3,Albania,ALB,"International tourism, number of arrivals",ST.INT.ARVL,NaN,NaN,NaN,NaN,NaN,NaN,...,2932000.0,3514000.0,3256000.0,3673000.0,4131000.0,4736000.0,5118000.0,5927000.0,6406000.0,NaN
4,Andorra,AND,"International tourism, number of arrivals",ST.INT.ARVL,NaN,NaN,NaN,NaN,NaN,NaN,...,7983000.0,7900000.0,7676000.0,7797000.0,7850000.0,8025000.0,8152000.0,8328000.0,8235000.0,NaN

In [5]:
book_csv=pd.read_csv("data/Book1.csv")
book_csv.head()

          Country CountryCode CountryCode2   x
0     Afghanistan          AF          AFG   4
1         Albania          AL          ALB   8
2         Algeria          DZ          DZA  12
3  American Samoa          AS          ASM  16
4         Andorra          AD          AND  20

In [6]:
revenues_csv=pd.read_csv("data/revenues.csv")
revenues_csv.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020
0,Aruba,ABW,"International tourism, receipts (current US$)",ST.INT.RCPT.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,1.358000e+09,1.412000e+09,1.506000e+09,1.625000e+09,1.659000e+09,1.757000e+09,1.855000e+09,2.029000e+09,2.091000e+09,NaN
1,Afghanistan,AFG,"International tourism, receipts (current US$)",ST.INT.RCPT.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,1.650000e+08,1.670000e+08,1.790000e+08,1.210000e+08,8.600000e+07,6.200000e+07,1.600000e+07,5.000000e+07,8.500000e+07,NaN
2,Angola,AGO,"International tourism, receipts (current US$)",ST.INT.RCPT.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,6.530000e+08,7.110000e+08,1.241000e+09,1.597000e+09,1.171000e+09,6.280000e+08,8.840000e+08,5.570000e+08,3.950000e+08,NaN
3,Albania,ALB,"International tourism, receipts (current US$)",ST.INT.RCPT.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,1.833000e+09,1.623000e+09,1.670000e+09,1.849000e+09,1.613000e+09,1.821000e+09,2.050000e+09,2.306000e+09,2.458000e+09,NaN
4,Andorra,AND,"International tourism, receipts (current US$)",ST.INT.RCPT.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
clean_location=location_csv[["CountryName","CapitalLatitude","CapitalLongitude","CountryCode","ContinentName"]].dropna()
clean_location.head()

     CountryName  CapitalLatitude  CapitalLongitude CountryCode ContinentName
0  Aland Islands        60.116667         19.900000          AX        Europe
1        Albania        41.316667         19.816667          AL        Europe
2        Andorra        42.500000          1.516667          AD        Europe
3        Armenia        40.166667         44.500000          AM        Europe
4        Austria        48.200000         16.366667          AT        Europe

In [8]:
clean_location_df=clean_location.rename(columns={"CountryName":"country","CapitalLatitude":"latitude","CapitalLongitude":"longitude","CountryCode": "country_code", "ContinentName": "continent_name"})
clean_location_df.to_csv("output/clean_location.csv", index=False)
clean_location_df.head()

         country   latitude  longitude country_code continent_name
0  Aland Islands  60.116667  19.900000           AX         Europe
1        Albania  41.316667  19.816667           AL         Europe
2        Andorra  42.500000   1.516667           AD         Europe
3        Armenia  40.166667  44.500000           AM         Europe
4        Austria  48.200000  16.366667           AT         Europe

In [9]:
clean_arrivals=arrivals_csv[["Country Code","1995","1996","1997","1998","1999","2000","2001","2002","2003","2004","2005","2006","2007","2008","2009","2010","2011","2012","2013","2014","2015","2016","2017","2018","2019"]].dropna()
clean_arrivals.head()

,Country Code,1995,1996,1997,1998,1999,2000,2001,2002,2003,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,ABW,912000.00,957000.00,947000.00,906000.00,972000.00,1211000.00,1178000.00,1225000.00,1184000.00,...,1394000.0,1469000.00,1481000.00,1667000.00,1739000.0,1832000.00,1758000.00,1863000.0,1897000.0,1951000.0
2,AGO,9000.00,21000.00,45000.00,52000.00,45000.00,51000.00,67000.00,91000.00,107000.00,...,425000.0,481000.00,528000.00,650000.00,595000.0,592000.00,397000.00,261000.0,218000.0,218000.0
3,ALB,304000.00,287000.00,119000.00,184000.00,371000.00,317000.00,354000.00,470000.00,557000.00,...,2417000.0,2932000.00,3514000.00,3256000.00,3673000.0,4131000.00,4736000.00,5118000.0,5927000.0,6406000.0
5,ARB,30238040.81,30557179.06,31691821.51,33564164.75,37847470.51,41402657.74,42608150.07,48672412.96,51600193.07,...,100534799.2,84657021.52,94573456.57,94519121.56,100719164.9,96757390.61,94989926.05,101336098.2,109134074.9,116080347.5
7,ARG,2289000.00,2614000.00,2764000.00,3012000.00,2898000.00,2909000.00,2620000.00,2820000.00,2995000.00,...,6800000.0,6703000.00,6497000.00,6510000.00,7165000.0,6816000.00,6668000.00,6711000.0,6942000.0,7399000.0

In [10]:
clean_arrivals_df=clean_arrivals.rename(columns={"Country Code":"country_code","1995":"total_arrivals_1995","1996":"total_arrivals_1996","1997":"total_arrivals_1997","1998":"total_arrivals_1998","1999":"total_arrivals_1999","2000":"total_arrivals_2000","2001":"total_arrivals_2001","2002":"total_arrivals_2002","2003":"total_arrivals_2003","2004":"total_arrivals_2004","2005":"total_arrivals_2005","2006":"total_arrivals_2006","2007":"total_arrivals_2007","2008":"total_arrivals_2008","2009":"total_arrivals_2009","2010":"total_arrivals_2010","2011":"total_arrivals_2011","2012":"total_arrivals_2012","2013":"total_arrivals_2013","2014":"total_arrivals_2014","2015":"total_arrivals_2015","2016":"total_arrivals_2016","2017":"total_arrivals_2017","2018":"total_arrivals_2018","2019":"total_arrivals_2019"})
clean_arrivals_df.to_csv("output/clean_arrivals.csv",index=False)
clean_arrivals_df.head()

,country_code,total_arrivals_1995,total_arrivals_1996,total_arrivals_1997,total_arrivals_1998,total_arrivals_1999,total_arrivals_2000,total_arrivals_2001,total_arrivals_2002,total_arrivals_2003,...,total_arrivals_2010,total_arrivals_2011,total_arrivals_2012,total_arrivals_2013,total_arrivals_2014,total_arrivals_2015,total_arrivals_2016,total_arrivals_2017,total_arrivals_2018,total_arrivals_2019
0,ABW,912000.00,957000.00,947000.00,906000.00,972000.00,1211000.00,1178000.00,1225000.00,1184000.00,...,1394000.0,1469000.00,1481000.00,1667000.00,1739000.0,1832000.00,1758000.00,1863000.0,1897000.0,1951000.0
2,AGO,9000.00,21000.00,45000.00,52000.00,45000.00,51000.00,67000.00,91000.00,107000.00,...,425000.0,481000.00,528000.00,650000.00,595000.0,592000.00,397000.00,261000.0,218000.0,218000.0
3,ALB,304000.00,287000.00,119000.00,184000.00,371000.00,317000.00,354000.00,470000.00,557000.00,...,2417000.0,2932000.00,3514000.00,3256000.00,3673000.0,4131000.00,4736000.00,5118000.0,5927000.0,6406000.0
5,ARB,30238040.81,30557179.06,31691821.51,33564164.75,37847470.51,41402657.74,42608150.07,48672412.96,51600193.07,...,100534799.2,84657021.52,94573456.57,94519121.56,100719164.9,96757390.61,94989926.05,101336098.2,109134074.9,116080347.5
7,ARG,2289000.00,2614000.00,2764000.00,3012000.00,2898000.00,2909000.00,2620000.00,2820000.00,2995000.00,...,6800000.0,6703000.00,6497000.00,6510000.00,7165000.0,6816000.00,6668000.00,6711000.0,6942000.0,7399000.0

In [11]:
clean_revenues=revenues_csv[["Country Code","1995","1996","1997","1998","1999","2000","2001","2002","2003","2004","2005","2006","2007","2008","2009","2010","2011","2012","2013","2014","2015","2016","2017","2018","2019"]].dropna()
clean_revenues.head()

,Country Code,1995,1996,1997,1998,1999,2000,2001,2002,2003,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,ABW,5.540000e+08,6.660000e+08,7.260000e+08,7.860000e+08,7.820000e+08,8.500000e+08,8.250000e+08,8.350000e+08,8.581000e+08,...,1.254000e+09,1.358000e+09,1.412000e+09,1.506000e+09,1.625000e+09,1.659000e+09,1.757000e+09,1.855000e+09,2.029000e+09,2.091000e+09
2,AGO,2.700000e+07,3.800000e+07,2.400000e+07,3.900000e+07,3.100000e+07,3.400000e+07,3.500000e+07,5.100000e+07,6.300000e+07,...,7.260000e+08,6.530000e+08,7.110000e+08,1.241000e+09,1.597000e+09,1.171000e+09,6.280000e+08,8.840000e+08,5.570000e+08,3.950000e+08
3,ALB,7.000000e+07,9.400000e+07,3.400000e+07,6.000000e+07,2.180000e+08,3.980000e+08,4.510000e+08,4.920000e+08,5.370000e+08,...,1.778000e+09,1.833000e+09,1.623000e+09,1.670000e+09,1.849000e+09,1.613000e+09,1.821000e+09,2.050000e+09,2.306000e+09,2.458000e+09
6,ARE,6.320000e+08,7.430000e+08,8.140000e+08,8.590000e+08,8.930000e+08,1.063000e+09,1.200000e+09,1.332000e+09,1.438000e+09,...,8.577000e+09,9.204000e+09,1.092400e+10,1.238900e+10,1.522100e+10,1.748100e+10,1.949600e+10,2.104900e+10,2.137200e+10,3.841330e+10
7,ARG,2.550000e+09,2.975000e+09,3.153000e+09,3.353000e+09,3.175000e+09,3.195000e+09,2.756000e+09,1.716000e+09,2.306000e+09,...,5.605000e+09,6.058000e+09,5.665000e+09,5.199000e+09,5.645000e+09,5.441000e+09,5.466000e+09,5.830000e+09,5.999000e+09,5.654000e+09

In [12]:
clean_revenues_df=clean_revenues.rename(columns={"Country Code":"country_code","1995":"total_revenues_1995","1996":"total_revenues_1996","1997":"total_revenues_1997","1998":"total_revenues_1998","1999":"total_revenues_1999","2000":"total_revenues_2000","2001":"total_revenues_2001","2002":"total_revenues_2002","2003":"total_revenues_2003","2004":"total_revenues_2004","2005":"total_revenues_2005","2006":"total_revenues_2006","2007":"total_revenues_2007","2008":"total_revenues_2008","2009":"total_revenues_2009","2010":"total_revenues_2010","2011":"total_revenues_2011","2012":"total_revenues_2012","2013":"total_revenues_2013","2014":"total_revenues_2014","2015":"total_revenues_2015","2016":"total_revenues_2016","2017":"total_revenues_2017","2018":"total_revenues_2018","2019":"total_revenues_2019"})
clean_revenues_df.to_csv("output/clean_revenues.csv",index=False)

clean_revenues_df.head()

,country_code,total_revenues_1995,total_revenues_1996,total_revenues_1997,total_revenues_1998,total_revenues_1999,total_revenues_2000,total_revenues_2001,total_revenues_2002,total_revenues_2003,...,total_revenues_2010,total_revenues_2011,total_revenues_2012,total_revenues_2013,total_revenues_2014,total_revenues_2015,total_revenues_2016,total_revenues_2017,total_revenues_2018,total_revenues_2019
0,ABW,5.540000e+08,6.660000e+08,7.260000e+08,7.860000e+08,7.820000e+08,8.500000e+08,8.250000e+08,8.350000e+08,8.581000e+08,...,1.254000e+09,1.358000e+09,1.412000e+09,1.506000e+09,1.625000e+09,1.659000e+09,1.757000e+09,1.855000e+09,2.029000e+09,2.091000e+09
2,AGO,2.700000e+07,3.800000e+07,2.400000e+07,3.900000e+07,3.100000e+07,3.400000e+07,3.500000e+07,5.100000e+07,6.300000e+07,...,7.260000e+08,6.530000e+08,7.110000e+08,1.241000e+09,1.597000e+09,1.171000e+09,6.280000e+08,8.840000e+08,5.570000e+08,3.950000e+08
3,ALB,7.000000e+07,9.400000e+07,3.400000e+07,6.000000e+07,2.180000e+08,3.980000e+08,4.510000e+08,4.920000e+08,5.370000e+08,...,1.778000e+09,1.833000e+09,1.623000e+09,1.670000e+09,1.849000e+09,1.613000e+09,1.821000e+09,2.050000e+09,2.306000e+09,2.458000e+09
6,ARE,6.320000e+08,7.430000e+08,8.140000e+08,8.590000e+08,8.930000e+08,1.063000e+09,1.200000e+09,1.332000e+09,1.438000e+09,...,8.577000e+09,9.204000e+09,1.092400e+10,1.238900e+10,1.522100e+10,1.748100e+10,1.949600e+10,2.104900e+10,2.137200e+10,3.841330e+10
7,ARG,2.550000e+09,2.975000e+09,3.153000e+09,3.353000e+09,3.175000e+09,3.195000e+09,2.756000e+09,1.716000e+09,2.306000e+09,...,5.605000e+09,6.058000e+09,5.665000e+09,5.199000e+09,5.645000e+09,5.441000e+09,5.466000e+09,5.830000e+09,5.999000e+09,5.654000e+09

In [13]:
clean_book_df=book_csv[["CountryCode","CountryCode2"]].dropna()
clean_book_df=clean_book_df.rename(columns= {"CountryCode" : "country_code","CountryCode2" :"country_code2"})
clean_book_df.to_csv("output/clean_book.csv",index=False)
clean_book_df.head()

  country_code country_code2
0           AF           AFG
1           AL           ALB
2           DZ           DZA
3           AS           ASM
4           AD           AND

In [14]:
merge_loc_book_df= pd.merge(clean_location_df,clean_book_df,on="country_code",how="inner")
loc_book_df=merge_loc_book_df.drop(["country_code"],axis=1).rename(columns={"country_code2":"country_code"})
loc_book_df=loc_book_df.loc[loc_book_df["continent_name"]=="Europe"]
loc_book_df.head()

         country   latitude  longitude continent_name country_code
0  Aland Islands  60.116667  19.900000         Europe          ALA
1        Albania  41.316667  19.816667         Europe          ALB
2        Andorra  42.500000   1.516667         Europe          AND
3        Armenia  40.166667  44.500000         Europe          ARM
4        Austria  48.200000  16.366667         Europe          AUT

In [15]:
location=loc_book_df.to_csv("output/location.csv",index=False)
location

In [16]:
arrivals_loc_merge=pd.merge(loc_book_df,clean_arrivals_df,on="country_code",how="inner")
arrivals_loc_merge.head()

,country,latitude,longitude,continent_name,country_code,total_arrivals_1995,total_arrivals_1996,total_arrivals_1997,total_arrivals_1998,total_arrivals_1999,...,total_arrivals_2010,total_arrivals_2011,total_arrivals_2012,total_arrivals_2013,total_arrivals_2014,total_arrivals_2015,total_arrivals_2016,total_arrivals_2017,total_arrivals_2018,total_arrivals_2019
0,Albania,41.316667,19.816667,Europe,ALB,304000.0,287000.0,119000.0,184000.0,371000.0,...,2417000.0,2932000.0,3514000.0,3256000.0,3673000.0,4131000.0,4736000.0,5118000.0,5927000.0,6406000.0
1,Armenia,40.166667,44.500000,Europe,ARM,12000.0,13000.0,23000.0,32000.0,41000.0,...,684000.0,758000.0,963000.0,1084000.0,1204000.0,1192000.0,1260000.0,1495000.0,1652000.0,1894000.0
2,Austria,48.200000,16.366667,Europe,AUT,17173000.0,17090000.0,16647000.0,17352000.0,17467000.0,...,22004000.0,23012000.0,24151000.0,24813000.0,25291000.0,26728000.0,28121000.0,29460000.0,30816000.0,31884000.0
3,Azerbaijan,40.383333,49.866667,Europe,AZE,93000.0,210000.0,306000.0,483000.0,602000.0,...,1963000.0,2239000.0,2484000.0,2509000.0,2298000.0,2006000.0,2249000.0,2697000.0,2850000.0,3170000.0
4,Belgium,50.833333,4.333333,Europe,BEL,5560000.0,5829000.0,6037000.0,6179000.0,6369000.0,...,7186000.0,7494000.0,7560000.0,7684000.0,7887000.0,8355000.0,7481000.0,8385000.0,9119000.0,9343000.0

In [17]:
arrivals=arrivals_loc_merge.to_csv("output/arrivals.csv",index=False)
arrivals

In [18]:
revenues_loc_merge=pd.merge(loc_book_df,clean_revenues_df,on="country_code",how="inner")
revenues_loc_merge.head()

,country,latitude,longitude,continent_name,country_code,total_revenues_1995,total_revenues_1996,total_revenues_1997,total_revenues_1998,total_revenues_1999,...,total_revenues_2010,total_revenues_2011,total_revenues_2012,total_revenues_2013,total_revenues_2014,total_revenues_2015,total_revenues_2016,total_revenues_2017,total_revenues_2018,total_revenues_2019
0,Albania,41.316667,19.816667,Europe,ALB,70000000.0,94000000.0,34000000.0,6.000000e+07,2.180000e+08,...,1.778000e+09,1.833000e+09,1.623000e+09,1.670000e+09,1.849000e+09,1.613000e+09,1.821000e+09,2.050000e+09,2.306000e+09,2.458000e+09
1,Armenia,40.166667,44.500000,Europe,ARM,14000000.0,18000000.0,33000000.0,4.100000e+07,4.700000e+07,...,6.940000e+08,7.620000e+08,8.530000e+08,9.050000e+08,9.940000e+08,9.560000e+08,1.037000e+09,1.224000e+09,1.358000e+09,1.553000e+09
2,Azerbaijan,40.383333,49.866667,Europe,AZE,87000000.0,57000000.0,176000000.0,1.430000e+08,9.300000e+07,...,7.920000e+08,1.500000e+09,2.634000e+09,2.618000e+09,2.713000e+09,2.535000e+09,2.855000e+09,3.214000e+09,2.830000e+09,2.004100e+09
3,Belarus,53.900000,27.566667,Europe,BLR,28000000.0,61000000.0,40000000.0,5.400000e+07,9.200000e+07,...,6.650000e+08,7.470000e+08,9.860000e+08,1.156000e+09,1.230000e+09,1.013000e+09,1.019000e+09,1.124500e+09,1.221000e+09,1.290000e+09
4,Bulgaria,42.683333,23.316667,Europe,BGR,662000000.0,541000000.0,517000000.0,1.150000e+09,1.184000e+09,...,3.807000e+09,4.297000e+09,3.975000e+09,4.410000e+09,4.518000e+09,3.583000e+09,4.164000e+09,4.678000e+09,5.055000e+09,4.825000e+09

In [19]:
revenues=revenues_loc_merge.to_csv("output/revenues.csv",index=False)
revenues

In [22]:
engine = create_engine('postgres://xyapznezeaqswq:563af6f1a293c52937083ed16940c84d274b616f8e2202c9cd74c95ae39916b8@ec2-52-21-252-142.compute-1.amazonaws.com:5432/d4g7j0al3kor5t')

In [23]:
engine.table_names()

['clean_arrivals', 'clean_revenues']